tap "ascii-draw/ascii-tree"
tap "charmbracelet/tap"
tap "jandedobbeleer/oh-my-posh"
# Code searching, linting, rewriting
brew "ast-grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# USB programmer
brew "dfu-util"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Free lossless audio codec
brew "flac"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Run multiple commands in parallel
brew "mprocs"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Audio time stretcher tool and library
brew "rubberband"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# SOund eXchange: universal sound sample translator
brew "sox"
# Minimal, customizable and neofetch-like weather CLI based on rainy
brew "stormy"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# A command line tool for drawing tree structures with ascii characters.
brew "ascii-draw/ascii-tree/astree"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli@beta"
# Chromium based browser
cask "arc"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
cask "font-commit-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-victor-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Music streaming service
cask "spotify"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
