tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "bat"
brew "gcc"
brew "btop"
brew "eza"
brew "fastfetch"
brew "flac"
brew "fzf"
brew "gh"
brew "htop"
brew "jq"
brew "lazygit"
brew "neovim"
brew "postgresql@14", restart_service: true
brew "python@3.11"
brew "ripgrep"
brew "spaceship"
brew "stow"
brew "subversion"
brew "tmux"
brew "zsh"
brew "zsh-completions"
cask "arc"
cask "bruno"
cask "font-monaspace-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "kitty"
cask "spotify"
