1password
amd-ucode
base
base-devel
bat
btop
btrfs-progs
clipse
cmatrix
dolphin
dunst
efibootmgr
eza
firefox
fzf
git
htop
hyprcwd-git
hyprland
hyprpaper
iwd
kitty
libva-mesa-driver
linux
linux-firmware
nano
neofetch
neovim
network-manager-applet
networkmanager
obsidian
otf-monaspace-nerd
paru
paru-debug
plymouth
qt5-wayland
qt6-wayland
ripgrep
rofi
sddm
smartmontools
stow
tmux
unimatrix-git
vim
vulkan-radeon
waybar
wev
wget
wireless_tools
wl-clipboard
wofi
xclip
xdg-desktop-portal-hyprland
xdg-utils
xf86-video-amdgpu
xf86-video-ati
xorg-server
xorg-xinit
zram-generator
zsh
